## Exercise 1: Write a Pandas program to create and display a DataFrame from a specified dictionary data which has the index labels.

In [335]:
import numpy as np
exam_data  = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}

In [336]:
import pandas as pd
s = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h','i','j']
df = pd.DataFrame(exam_data)
df= df.set_index([s])
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

## Exercise 2: Write a Pandas program to select the rows where number of attempts in the examination is less than 2 and score greater than 15.
##### Use Data from previous problem

In [337]:
'''
this will not work
att = df['attempts'] == 1
att = df['score'] > 15
df[att]
'''
#df[(df['attempts'] == 1) & (df['score'] > 15)]
df.loc[(df['attempts'] ==1) & (df['score'] > 15)]

    name  score  attempts qualify
j  Jonas   19.0         1     yes

In [338]:
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

## Exerise 3: Change the value in row 'd' to 11.5
##### Use Data from previous questions

In [339]:
#df.iloc[[3],[1]] = 11.5
df.loc[['d'],['score']] = 11.5
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James   11.5         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [340]:
#sum of the examination attempts by the students
np.sum(df['attempts'])

19

In [341]:
d = {'col1': [1, 4, 3, 4, 5], 'col2': [4, 5, 6, 7, 8], 'col3': [7, 8, 9, 0, 1]}

In [342]:
df_d = pd.DataFrame(d)
df_d

   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1

## Exercise 4: Write a Pandas program to calculate the sum of the examination attempts by the students.
data: d = {'col1': [1, 4, 3, 4, 5], 'col2': [4, 5, 6, 7, 8], 'col3': [7, 8, 9, 0, 1]}

In [343]:
df_d.loc[(df_d['col1'] == 4)]

   col1  col2  col3
1     4     5     8
3     4     7     0

## Exercise 5: Drop a list of rows from a specified DataFrame
###### data: 
d = {'col1': [1, 4, 3, 4, 5], 'col2': [4, 5, 6, 7, 8], 'col3': [7, 8, 9, 0, 1]}

In [344]:
df_d.drop([2,4])

   col1  col2  col3
0     1     4     7
1     4     5     8
3     4     7     0

## Exercise 6:  Check whether a given column is present in a DataFrame or not
###### data: 
d = {'col1': [1, 2, 3, 4, 7], 'col2': [4, 5, 6, 9, 5], 'col3': [7, 8, 12, 1, 11]}

In [345]:
cols = ['col4', 'col1']
for col in cols:
    if col in df_d.columns:
        print('{} is present in DataFrame'.format(col))
    else:
        print('{} is not present in DataFrame'.format(col))

col4 is not present in DataFrame
col1 is present in DataFrame

## Exercise 7: Get column index from column name of a given DataFrame

###### data: 
d = {'col1': [1, 2, 3, 4, 7], 'col2': [4, 5, 6, 9, 5], 'col3': [7, 8, 12, 1, 11]}

##### HINT: Try using a function called get_loc():
Syntax: 
dataframe.columns.get_loc()

In [346]:
d = {'col1': [1, 2, 3, 4, 7], 'col2': [4, 5, 6, 9, 5], 'col3': [7, 8, 12, 1, 11]}
df = pd.DataFrame(d)
df

   col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6    12
3     4     9     1
4     7     5    11

In [347]:
print('Index of col2 is :', df_d.columns.get_loc('col2'))

Index of col2 is : 1

## Exercise 8: Write a Pandas program to select all columns, except one given column in a DataFrame.
###### Use same data as previous problem

In [348]:
df.loc[:, df.columns != 'col3']
#df.loc[:,['col1','col2']]
#df[['col1','col2']]
#df[df.columns[0:2]]
#df.loc[:, df.columns.isin(['col1', 'col2'])]

   col1  col2
0     1     4
1     2     5
2     3     6
3     4     9
4     7     5

## Exercise 9:  Write a Pandas program to remove last n rows of a given DataFrame.

In [349]:
#df = df.iloc[:-2]
df = df.head(-2)
df

   col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6    12

## Exercise 10: Display the movies longer than 30 minutes and shorter than 360 minutes

In [350]:
df = pd.read_csv('D:\Docs\Data_Science\data\Inceptez_batch_16-main\IMDB-Movie-Data.csv')
df = df[['Title', 'Runtime (Minutes)']]
df = df.loc[(df['Runtime (Minutes)'] > 30) & (df['Runtime (Minutes)'] < 360)]
df

                       Title  Runtime (Minutes)
0    Guardians of the Galaxy                121
1                 Prometheus                124
2                      Split                117
3                       Sing                108
4              Suicide Squad                123
..                       ...                ...
995     Secret in Their Eyes                111
996          Hostel: Part II                 94
997   Step Up 2: The Streets                 98
998             Search Party                 93
999               Nine Lives                 87

[1000 rows x 2 columns]